In [1]:
# pip install pandas

In [1]:
import pandas as pd
import numpy as np

## Basics

In [ ]:
print(pd.__file__)

In [2]:
data={'Id':[100,101,102,103],'Name':['Ramu','Raju','Tony','Jayan'],'Age':[10,20,35,24],'Marks':[48,56,19,36]}
data1=pd.DataFrame(data)
data1

    Id   Name  Age  Marks
0  100   Ramu   10     48
1  101   Raju   20     56
2  102   Tony   35     19
3  103  Jayan   24     36

In [ ]:
# get shape of dataframe
data1.shape

In [ ]:
# display the first (5 rows is default)
data1.head()
data1.head(3)

In [ ]:
# return last 5 rows
data1.tail()
data1.tail(2)

In [ ]:
# Get names of cols
data1.columns

In [ ]:
# Accessing a specific col
data1.Age

In [ ]:
data1['Age']

In [ ]:
# Accessing multiple col
data1[['Id','Name']]

In [3]:
# Adding a new col to dataframe
new_data=data1.copy()
address=['Delhi','Patna','Goa','Kerala']
new_data['location']=address
new_data

    Id   Name  Age  Marks location
0  100   Ramu   10     48    Delhi
1  101   Raju   20     56    Patna
2  102   Tony   35     19      Goa
3  103  Jayan   24     36   Kerala

In [ ]:
new_data=new_data.drop('Age',axis=1)
new_data

In [ ]:
# default sort asce
data1.sort_values('Age',ascending=False)
data1.sort_values('Name')

In [4]:
# view index assigned to dataframe
data1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
# change index to some other col name
data_index=data1.set_index('Id')
data_index

      Name  Age  Marks
Id
100   Ramu   10     48
101   Raju   20     56
102   Tony   35     19
103  Jayan   24     36

In [6]:
# reset index to previous  stage
data_index=data_index.reset_index()
data_index

    Id   Name  Age  Marks
0  100   Ramu   10     48
1  101   Raju   20     56
2  102   Tony   35     19
3  103  Jayan   24     36

In [7]:
# loc
data_index.loc[3]

Id         103
Name     Jayan
Age         24
Marks       36
Name: 3, dtype: object

In [ ]:
data_index.loc[data_index.Name=='Jayan']

In [8]:
data=data_index.set_index('Name')
data

        Id  Age  Marks
Name
Ramu   100   10     48
Raju   101   20     56
Tony   102   35     19
Jayan  103   24     36

In [ ]:
data.loc['Jayan']

In [9]:
# iloc-pass only index
data.iloc[2]

Id       102
Age       35
Marks     19
Name: Tony, dtype: int64

In [10]:
data.iloc[[0,2,1]]

       Id  Age  Marks
Name
Ramu  100   10     48
Tony  102   35     19
Raju  101   20     56

In [11]:
# dtypes
data1.dtypes

Id        int64
Name     object
Age       int64
Marks     int64
dtype: object

In [12]:
# unique values
data1.Name.unique()

array(['Ramu', 'Raju', 'Tony', 'Jayan'], dtype=object)

In [13]:
data1['Name'].unique

<bound method Series.unique of 0     Ramu
1     Raju
2     Tony
3    Jayan
Name: Name, dtype: object>

In [14]:
data=pd.read_csv('weather_data.csv')
data

           day     city  temperature  windspeed   event
0   01-01-2017  newyork           32          6    Rain
1   01-04-2017  newyork           36          7   Sunny
2   01-05-2017  newyork           28         12    Snow
3   01-06-2017  newyork           33          7   Sunny
4   01-07-2017   mumbai           90          5   Sunny
5   01-08-2017   mumbai           85         12     Fog
6   01-09-2017   mumbai           87         15     Fog
7   01-10-2017   mumbai           92          5    Rain
8   01-11-2017    paris           45         20   Sunny
9   01-12-2017    paris           50         13  Cloudy
10  01-13-2017    paris           54          8  Cloudy
11  01-14-2017    paris           42         10  Cloudy

In [15]:
# value counts
data.event.value_counts()

Sunny     4
Cloudy    3
Rain      2
Fog       2
Snow      1
Name: event, dtype: int64

In [16]:
# iterating col name
for i in data:
    print(i)

day
city
temperature
windspeed
event

In [17]:
# iterating col name and values
for i in data:
    print(data[i].unique())

['01-01-2017' '01-04-2017' '01-05-2017' '01-06-2017' '01-07-2017'
 '01-08-2017' '01-09-2017' '01-10-2017' '01-11-2017' '01-12-2017'
 '01-13-2017' '01-14-2017']
['newyork' 'mumbai' 'paris']
[32 36 28 33 90 85 87 92 45 50 54 42]
[ 6  7 12  5 15 20 13  8 10]
['Rain' 'Sunny' 'Snow' 'Fog' 'Cloudy']

In [18]:
# getting col name and values
for col,value in data.iteritems():
    print(col)
    print(value)

day
0     01-01-2017
1     01-04-2017
2     01-05-2017
3     01-06-2017
4     01-07-2017
5     01-08-2017
6     01-09-2017
7     01-10-2017
8     01-11-2017
9     01-12-2017
10    01-13-2017
11    01-14-2017
Name: day, dtype: object
city
0     newyork
1     newyork
2     newyork
3     newyork
4      mumbai
5      mumbai
6      mumbai
7      mumbai
8       paris
9       paris
10      paris
11      paris
Name: city, dtype: object
temperature
0     32
1     36
2     28
3     33
4     90
5     85
6     87
7     92
8     45
9     50
10    54
11    42
Name: temperature, dtype: int64
windspeed
0      6
1      7
2     12
3      7
4      5
5     12
6     15
7      5
8     20
9     13
10     8
11    10
Name: windspeed, dtype: int64
event
0       Rain
1      Sunny
2       Snow
3      Sunny
4      Sunny
5        Fog
6        Fog
7       Rain
8      Sunny
9     Cloudy
10    Cloudy
11    Cloudy
Name: event, dtype: object

C:\Users\Amjad\AppData\Local\Temp\ipykernel_10512\2056239730.py:2: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for col,value in data.iteritems():

In [ ]:
# iterating through rows and its values
for index,rows in data.iterrows():
    print(rows)
    print(col)

### Slicing

In [ ]:
data[1:4]

In [ ]:
data[:]

In [ ]:
data[['city','event']][1:3]

### basic operations

In [ ]:
data.temperature.max()

In [ ]:
data['temperature'].max()

In [ ]:
data['temperature'].min()

In [ ]:
data['temperature'].mean()

In [ ]:
data['temperature'].std()

In [ ]:
data.describe()

### Conditional selecting

In [ ]:
data[data['temperature']>40]

In [ ]:
data[data.temperature>40]

In [ ]:
data['temperature'].max()

In [ ]:
data['city'][data.temperature==data.temperature.max()]

In [ ]:
d=data[data.temperature==data.temperature.max()]
print(d)
d['city']

In [ ]:
d=data[data.windspeed==data.windspeed.max()]
d['event']

## Parsing dates

In [ ]:
data

In [ ]:
type(data['day'][0])

In [ ]:
data1=pd.read_csv('weather_data.csv',parse_dates=['day'])
data1

In [ ]:
type(data1['day'][0])

In [ ]:
new=pd.read_csv('Book1.csv')
new

In [ ]:
type(new['DOB'][0])

In [ ]:
new=pd.read_csv('Book1.csv',parse_dates=['DOB'])
new

In [ ]:
type(new['DOB'][0])

In [ ]:
data=pd.read_csv('weather_data.csv',parse_dates=['day'],index_col='day')
data

### date range

In [ ]:
# generate a date range
ind=pd.date_range('2018-01-01','2018-05-05')
ind

In [ ]:
type(ind)

### to datetime

In [ ]:
date=['2017-08-06','2017.08.10','2017/08/10','Jan 10,2017']
type(date[0])

In [ ]:
date=pd.to_datetime('2017/08.06')
date

In [ ]:
y=pd.to_datetime('13/12/17',yearfirst=True)
y

In [ ]:
y=pd.to_datetime('13/12/17',dayfirst=True)
y

### Handling Missing Values

In [ ]:
data_missing=pd.read_csv('weather_data_missing.csv')
data_missing

In [ ]:
# check for missing values
data_missing.isna()

In [ ]:
data_missing.isna().sum()

In [ ]:
data_missing.isnull().sum()

In [ ]:
# fill missing values 
data2=data_missing.fillna(0)
data2

In [ ]:
avg=data_missing['temperature'].mean()
data_missing.fillna(avg)

In [ ]:
# forward fill
data_missing.fillna(method='ffill')

In [ ]:
# backward fill
data_missing.fillna(method='bfill')

In [ ]:
# Linear interpolation (default)[fills with avg of preceeding and succeeding vals]

data_missing.interpolate()

In [ ]:
# drop rows with null vals
data_missing.dropna()

In [ ]:
# drops rows with full NaN vals
data_missing.dropna(how='all')

In [ ]:
data_missing.dropna(how='any')

## Replace

In [3]:
data=pd.read_csv('missing_weather_data.csv')
data

         day temperature windspeed   event
0   1/1/2017        32 F     6 mph    Rain
1   1/4/2017      -99999         9   Sunny
2   1/5/2017          28    -99999    Snow
3   1/6/2017      -99999         7       0
4   1/7/2017        32 C    -88888    Rain
5   1/8/2017        38 F    -99999   Sunny
6   1/9/2017          35   10 kmph       0
7  1/10/2017          34         8  Cloudy
8  1/11/2017          40        12   Sunny

In [ ]:
data.replace('-99999',np.NaN)

In [ ]:
data.replace(['-99999','-88888'],np.NaN)

In [ ]:
data.replace({'temperature':'-99999','windspeed':'-88888','event':'0'},np.NaN)

In [ ]:
data.replace({'temperature':'-99999','windspeed':['-88888','-99999'],'event':'0'},np.NaN)

In [ ]:
data.replace({'-99999':np.NaN,'-88888':np.NaN,'0':'Rain'})

In [ ]:
# to remove kmph,c,f
data.replace({'temperature':'[A-Za-z]','windspeed':'[A-Za-z]','event':'[A-Za-z]'},'',regex=True)

In [ ]:
data.replace(['Rain','Sunny','Cloudy','Snow'],[100,101,102,103])